Rails/WebsitesPrototypeBuilder/app/views/answers/destroy.js.erb

$('.delete_answer').bind('ajax:success', function() {
        $(this).closest('div').slideUp("slow");
});
---
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 1]]