Rails/WebsitesPrototypeBuilder/app/views/pages/designer.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."page_id" = 1
---
		<div id="comments">
			<% @page.comments.each do |comment| %>

SELECT "questions".* FROM "questions" WHERE "questions"."page_id" = 1
---
		<div id="questions">
			<% @page.questions.each do |question| %>