Rails/WebsitesPrototypeBuilder/app/views/pages/reviewer.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."page_id" = 1
---
 					 <% array = Array.new %>                 <!-- create new array to store in all comments' divs locations-->
					 <% @page.comments.each do |comment| %>  <!-- loop on all comments -->

SELECT "questions".* FROM "questions" WHERE "questions"."page_id" = 1
---
					 <% ansarray = Array.new %>
					 <% @page.questions.each do |question| %>

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = 1
---
					<h5>:اجابتك </h5>
					<% question.answers.each do |ans| %>