Rails/WebsitesPrototypeBuilder/app/views/pages/show.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`page_id` = 3
---
		<h4>التعليقلت</h4>
		<% @page.comments.each do |comment| %>