Rails/WebsitesPrototypeBuilder/app/controllers/answers_controller.rb

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "questions".* FROM "questions" WHERE "questions"."page_id" = 1 AND "questions"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "answers" ("answer", "created_at", "page_id", "question_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["answer", "lo"], ["created_at", Fri, 12 Apr 2013 22:06:15 UTC +00:00], ["page_id", nil], ["question_id", 1], ["updated_at", Fri, 12 Apr 2013 22:06:15 UTC +00:00]]
---
  def create
    # finds the selected page
  	@page = Page.find(params[:page_id])
  	@question = @page.questions.find([:question_id])
    @answer = @page.question.answers.build(params[:answer])
    respond_to do |format|
    if @answer.save

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 1]]
---
def destroy
    # find the item
    @answer = Answer.find(params[:id])
    @question = Question.find(params[:question_id])
    @page = Page.find(params[:page_id])
    @answer.destroy