Rails/WebsitesPrototypeBuilder/app/controllers/answer_questionnaires_controller.rb

  def create
    # finds the selected page
    @questionnaire = Questionnaire.find(params[:questionnaire_id])
  	@qquestion = @questionnaire.qquestions.find(params[:qquestion_id])
  	@answer =@qquestion.answer_questionnaires.build(params[:answer], :presence => true)
    respond_to do |format|
    if @answer.save
---
SELECT "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "qquestions".* FROM "qquestions" WHERE "qquestions"."questionnaire_id" = 1 AND "qquestions"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "answer_questionnaires" ("body", "created_at", "qquestion_id", "questionnaire_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", nil], ["created_at", Sat, 13 Apr 2013 00:42:21 UTC +00:00], ["qquestion_id", 1], ["questionnaire_id", nil], ["updated_at", Sat, 13 Apr 2013 00:42:21 UTC +00:00]]