Rails/WebsitesPrototypeBuilder/app/controllers/cardsorts_controller.rb

	def new
		@cardsort = Cardsort.new(params[:cardsort])
		@cardsort.save
---
INSERT INTO "cardsorts" ("created_at", "description", "open", "project_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 23 Apr 2013 10:16:53 UTC +00:00], ["description", nil], ["open", nil], ["project_id", nil], ["title", nil], ["updated_at", Tue, 23 Apr 2013 10:16:53 UTC +00:00]]

	def edit
		@cardsort = Cardsort.find(17)
---
SELECT "cardsorts".* FROM "cardsorts" WHERE "cardsorts"."id" = ? LIMIT 1  [["id", "1"]]