Rails/WebsitesPrototypeBuilder/app/controllers/comments_controller.rb

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("assigned_part", "body", "created_at", "page_id", "reviewer", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["assigned_part", "1"], ["body", "test comment"], ["created_at", Tue, 23 Apr 2013 10:15:10 UTC +00:00], ["page_id", 1], ["reviewer", nil], ["updated_at", Tue, 23 Apr 2013 10:15:10 UTC +00:00]]
---
  def create
    # finds the selected page
  	@page = Page.find(params[:page_id])
    @comment = @page.comments.build(params[:comment])
    respond_to do |format|
    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    # find the item
    @comment = Comment.find(params[:id])
    @page = Page.find(params[:page_id])
    @comment.destroy