Rails/WebsitesPrototypeBuilder/app/controllers/pages_controller.rb

SELECT `pages`.* FROM `pages`
---
  def index
    @pages = Page.all

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @page = Page.find(params[:id])

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 7 LIMIT 1
---
  def edit
    @page = Page.find(params[:id])

INSERT INTO `pages` (`created_at`, `html_markup`, `updated_at`) VALUES ('2013-03-26 22:25:01', 'HTML 1', '2013-03-26 22:25:01')
---
  def create
    html=params[:page][:html]
    @page = Page.new(params[:page])
    respond_to do |format|
      if @page.save

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 7 LIMIT 1
---
  def update
    @page = Page.find(params[:id])

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
DELETE FROM `pages` WHERE `pages`.`id` = 2
---
  def destroy
    @page = Page.find(params[:id])
    @page.destroy

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
---
  def reviewer
    @page = Page.find(params[:id])

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
---
  def designer
    @page = Page.find(params[:id])