Rails/WebsitesPrototypeBuilder/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    @projects = Project.all

INSERT INTO "projects" ("created_at", "description", "designer_id", "project_name", "project_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(params[:project])
    respond_to do |format|
      if @project.save