Rails/WebsitesPrototypeBuilder/app/controllers/questions_controller.rb

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "questions" ("assigned_part", "body", "created_at", "page_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["assigned_part", "17"], ["body", "question"], ["created_at", Fri, 12 Apr 2013 22:02:44 UTC +00:00], ["page_id", 1], ["updated_at", Fri, 12 Apr 2013 22:02:44 UTC +00:00]]
---
  def create
    # finds the selected page
  	@page = Page.find(params[:page_id])
    @question = @page.questions.build(params[:question])
    respond_to do |format|
    if @question.save

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1]]
---
  def destroy
    # find the item
    @question = Question.find(params[:id])
    @page = Page.find(params[:page_id])
    @question.destroy