Rails/WebsitesPrototypeBuilder/app/controllers/questionnaires_controller.rb

  def index
    @questionnaires = Questionnaire.all
---
SELECT "questionnaires".* FROM "questionnaires"

  def show
    @questionnaire = Questionnaire.find(params[:id])
---
SELECT "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."id" = ? LIMIT 1  [["id", "1"]]

  def answer_show
    @questionnaire = Questionnaire.find(params[:id])
---
SELECT "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @questionnaire = Questionnaire.new(params[:questionnaire])
    respond_to do |format|
      if @questionnaire.save
---
INSERT INTO "questionnaires" ("created_at", "project_id", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 12 Apr 2013 22:38:19 UTC +00:00], ["project_id", nil], ["title", "dfgdfg"], ["updated_at", Fri, 12 Apr 2013 22:38:19 UTC +00:00]]

  def destroy
    @questionnaire = Questionnaire.find(params[:id])
    @questionnaire.destroy
---
SELECT "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "questionnaires" WHERE "questionnaires"."id" = ?  [["id", 1]]