Rails/WebsitesPrototypeBuilder/app/controllers/steps_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1
SELECT "steps".* FROM "steps" WHERE "steps"."task_id" = 1 ORDER BY "steps"."id" DESC LIMIT 1
---
  def update
    @task =Task.find_by_id(params[:task_id])
    @task.update_taskResults(params,session[:task_result_id])
    returnHash = @task.update_taskResults(params,session[:task_result_id])
    if params[:change_id].to_f <= @task.steps.last.id.to_f