Rails/WebsitesPrototypeBuilder/app/controllers/tasks_controller.rb

SELECT "projects".* FROM "projects"
---
  def task_reviewer
    if Integer(Project.all.last.id) >= Integer(params[:project_id]) && Project.all.first.id <= Integer(params[:project_id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = 1
---
  def index
    @tasks = Project.find(params[:project_id]).tasks.all

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    @project = Project.find(params[:project_id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @task = Project.find(params[:project_id]).tasks.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = 1 AND "tasks"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @task = Project.find(params[:project_id]).tasks.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "tasks" ("created_at", "description", "name", "page_id", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 16 Apr 2013 07:31:14 UTC +00:00], ["description", ""], ["name", "Test Task"], ["page_id", 1], ["project_id", 1], ["updated_at", Tue, 16 Apr 2013 07:31:14 UTC +00:00]]
---
  def create
    @task = Project.find(params[:project_id]).tasks.new(params[:task])
    respond_to do |format|
      if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "tasks" SET "name" = 'New', "description" = 'sda', "updated_at" = '2013-04-16 09:24:29.374738' WHERE "tasks"."id" = 4
---
  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 4]]
---
  def destroy
    @task = Task.find(params[:id])
    @task.destroy

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "pages".* FROM "pages" WHERE "pages"."id" = 1 LIMIT 1
SELECT "steps".* FROM "steps" WHERE "steps"."task_id" = 2
---
  def edit_steps
    @project = Project.find(params[:project_id])
    @task = Task.find(params[:id])
    @steps = @task.steps
    @page = @task.page

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1
---
  def new_step
    @step = Step.new(:task_id => params[:id], :page_id => params[:page_id],
     :event => params[:event], :component => params[:component], :description => params[:description])
    @created = @step.save
    @task = Task.find_by_id(params[:id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1
SELECT "steps".* FROM "steps" WHERE "steps"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "steps" WHERE "steps"."id" = ?  [["id", 1]]
---
  def delete_step
    @task = Task.find_by_id(params[:task])
    @step = Step.find(params[:id])
    @step.destroy