Rails/WebsitesPrototypeBuilder/app/views/projects/index.html.erb

SELECT "projects".* FROM "projects"
---
<script type="text/javascript">
$(document).ready(function (){

  $('.alert').find('.close').click(function (){
    $.ajax({
      url: '/projects/take_tour',
      method: "POST"
    });
    $('.alert').remove();
  });
  <% if (!current_designer.tour_taken) %>
    <% if (current_designer.projects.empty?) %>
      $('#project-alert').fadeIn(400);
      $('.add_button').click(function (){
        $('#project-alert').fadeOut(400);
      });
    <% else %>
    $('.project-div').click(function(){
       $('#sidebar-alert').fadeOut(400);
       $('#design-alert').fadeIn(400);
       window.setTimeout(function(){
        $('#design-alert').fadeOut(400);