Rails/WebsitesPrototypeBuilder/app/views/questionnaires/answer_show.html.erb

		<hr>
		<% @questionnaire.qquestions.each do |question| %>
---
SELECT "qquestions".* FROM "qquestions" WHERE "qquestions"."questionnaire_id" = 1