Rails/WebsitesPrototypeBuilder/app/views/tasks/_calculate_success.html.erb

SELECT "task_results".* FROM "task_results" WHERE "task_results"."id" = ? LIMIT 1  [["id", "1"]]
---
<% f = TaskResult.find(params[:id])%>