Rails/WebsitesPrototypeBuilder/app/views/tasks/index.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT COUNT(*) FROM "pages" WHERE "pages"."project_id" = 1
---

<% if Project.find(params[:project_id]).pages.empty? %>