Rails/WebsitesPrototypeBuilder/app/views/tasks/show.html.erb

<div id="task_results">
  <% if @task.task_results.length !=0 %>
---
SELECT "task_results".* FROM "task_results" WHERE "task_results"."task_id" = 2